Revit 2027 API
UnitUtils.IsSymbol Method
 Checks whether a ForgeTypeId identifies a symbol.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsSymbol(
	ForgeTypeId symbolTypeId
)
Public Shared Function IsSymbol (
	symbolTypeId As ForgeTypeId
) As Boolean
public:
static bool IsSymbol(
	ForgeTypeId^ symbolTypeId
)
static member IsSymbol :
        symbolTypeId : ForgeTypeId -> bool
Parameters
symbolTypeId ForgeTypeId
 The identifier to check.
Return Value
Boolean
 True if the ForgeTypeId identifies a symbol, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 The SymbolTypeId class offers symbol identifiers.
See Also
Reference
UnitUtils Class
Autodesk.Revit.DB Namespace